In [1]:
!cat examples/ex1.csv
a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

cat: examples/ex1.csv: No such file or directory

NameError: name 'a' is not defined

In [2]:
!cat examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
df = pd.read_csv('examples/ex1.csv')

NameError: name 'pd' is not defined

In [4]:
import pandas as pd

In [5]:
df = pd.read_csv('examples/ex1.csv')

In [6]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
pd.read_table('examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
!cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [9]:
pd.read_csv('examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [10]:
pd.read_csv('examples/ex2.csv', names=['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
names = ['a', 'b', 'c', 'd', 'message']

In [12]:
pd.read_csv('examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [13]:
!cat examples/csv_mindex.csv

key1, key2, value1, value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [15]:
parsed = pd.read_csv('examples/csv_mindex.csv', index_col=['key1', 'key2'])

In [16]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [17]:
!cat examples/ex1.csv

a,b,,d,message
1,2,3,NA,hello
5,6,7,8,world
9,10,11,12,foo

In [21]:
result = pd.read_csv('examples/ex1.csv')

In [22]:
result

   a   b   c     d message
0  1   2   3   NaN   hello
1  5   6   7   NaN   world
2  9  10  11  12.0     foo

In [23]:
pd.isnull(result)

       a      b      c      d  message
0  False  False  False   True    False
1  False  False  False   True    False
2  False  False  False  False    False

In [24]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [25]:
pd.read_csv('examples/ex1.csv', na_values=sentinels)

   a   b   c     d message
0  1   2   3   NaN   hello
1  5   6   7   NaN   world
2  9  10  11  12.0     NaN

In [27]:
result  = pd.read_csv('examples/ex6.csv')

result

In [28]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [31]:
pd.options.display.max_rows = 15

In [32]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [33]:
pd.read_csv('examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [34]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [35]:
chunker

In [36]:
chunker = pd.read_csv('examples/ex6.csv', chunksize=1000)

In [37]:
from pandas import Series, DataFrame

In [39]:
tot = Series([])
for piece in chunker:
    tot  = tot.add(piece['key'].value_counts(), fill_value=0)

/var/folders/tl/3mcdykwx5g145dz_cpc1vdxc0000gn/T/ipykernel_13980/2196906475.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot = Series([])

In [40]:
tot = tot.sort_values(ascending=False)

In [41]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [42]:
data  = pd.read_csv('examples/ex5.csv')

In [43]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [44]:
data.to_csv('examples/out.csv')

In [45]:
!cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [46]:
import sys

In [47]:
data.to_csv(sys.stdout,  sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [48]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [49]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [50]:
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [51]:
dates = pd.date_range('1/1/2000', periods=7)

In [52]:
ts = Series(np.arange(7), index=dates)

NameError: name 'np' is not defined

In [53]:
import numpy as np

In [54]:
ts = Series(np.arange(7), index=dates)

In [55]:
ts.to_csv('examples/tseries.csv')

In [56]:
!cat examples/tseries.csv

,0
2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

In [57]:
!cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [58]:
import csv

In [59]:
f = open('examples/ex7.csv')

In [60]:
reader = csv.reader(f)

In [61]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [62]:
with open('examples/ex7.csv') as f:
    lines = list(csv.reader(f))

In [63]:
header, values = lines[0], lines[1:]

In [64]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [65]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [67]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [68]:
reader = csv.reader(f, dialect=my_dialect)

ValueError: I/O operation on closed file.

In [69]:
f = open('examples/ex7.csv')

In [70]:
reader = csv.reader(f, dialect=my_dialect)

In [71]:
reader

In [72]:
with open('mydata.csv', 'w') as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(('one', 'two', 'three'))
    writer.writerow(('1', '2', '3'))
    writer.writerow(('4','5','6'))
    writer.writerow(('7', '8', '9'))

In [80]:
obj = """
{
    "name":  "Wes",
    "places_lived": ["United State", "Spain", "Germany"],
    "pet": null,
    "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
    {"name": "Katie","age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [74]:
import json

In [81]:
result = json.loads(obj)

result

In [82]:
result

{'name': 'Wes',
 'places_lived': ['United State', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [84]:
asjson = json.dumps(result)

In [85]:
asjson

'{"name": "Wes", "places_lived": ["United State", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

In [86]:
siblings  = DataFrame(result['siblings'], columns = ['name', 'age'])

In [87]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [88]:
!cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [89]:
data = pd.read_json('examples/example.json')

In [90]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [91]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [92]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [93]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

In [94]:
len(tables)

1

In [95]:
failures = tables[0]

In [96]:
failures.head(9)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"
5,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015","April 13, 2016"
6,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015","October 24, 2016"
7,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015","August 17, 2016"
8,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015","July 12, 2016"

In [97]:
close_timestamps  = pd.to_datetime(failures['Closing Date'])

In [98]:
close_timestamps.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
2013     24
2014     18
2002     11
2015      8
2016      5
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, dtype: int64

In [1]:
from lxml import objectify

path = 'datasets/mta_perf/Performance_MNR.xml'

In [2]:
parsed = objectify.parse(open(path))

In [3]:
root = parsed.getroot()

In [4]:
data = []

In [5]:
skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ', 'DESIRED_CHANGE', 'DECIMAL_PLACES']

In [6]:
for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [7]:
from pandas import Series, DataFrame

In [8]:
perf = DataFrame(data)

perf.head()

In [10]:
from io  import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [11]:
root

In [12]:
root.get('href')

'http://www.google.com'

In [13]:
root.text

'Google'

In [16]:
frame = pd.read_csv('examples/ex1.csv')

In [15]:
import pandas as pd

In [17]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
frame.to_pickle('examples/frame_pickle')

In [19]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [22]:
frame =DataFrame({'a': np.random.randn(100)})

In [21]:
import numpy as np

In [25]:
store = pd.HDFStore('mydata.h5')

In [26]:
store['obj1'] = frame

In [27]:
store['obj1_col'] = frame['a']

In [28]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [29]:
store['obj1']

           a
0   0.928497
1   1.583501
2   0.751849
3   0.917514
4  -0.419662
..       ...
95  0.625506
96 -0.094513
97  0.234654
98 -0.948332
99  0.546261

[100 rows x 1 columns]

In [30]:
store.put('obj2', frame, format='table')

In [31]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  1.189768
11  0.027676
12 -1.157414
13  0.598341
14  0.745168
15  0.783935

In [32]:
store.close()

In [33]:
frame.to_hdf('mydata.h5', 'obj3', format='table')

In [34]:
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.928497
1  1.583501
2  0.751849
3  0.917514
4 -0.419662

In [35]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [36]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [37]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')

In [38]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [39]:
writer = pd.ExcelWriter('examples/ex2.xlsx')

In [40]:
frame.to_excel(writer, 'Sheet1')